[
  {
    "title": "Lecture Notes: Optimization for Machine Learning",
    "authors": [
      "Elad Hazan"
    ],
    "abstract": "Lecture notes on optimization for machine learning, derived from a course at Princeton University and tutorials given in MLSS, Buenos Aires, as well as Simons Foundation, Berkeley.",
    "url": "http://arxiv.org/abs/1909.03550v1",
    "bibtex": "@article{lecture2019,\n  title={Lecture Notes: Optimization for Machine Learning},\n  author={Elad Hazan},\n  year={2019},\n  url={http://arxiv.org/abs/1909.03550v1},\n  note={arXiv preprint}\n}",
    "year": 2019,
    "relevance_score": 1.0,
    "source": "arxiv",
    "citation_count": null,
    "doi": null
  },
  {
    "title": "An Optimal Control View of Adversarial Machine Learning",
    "authors": [
      "Xiaojin Zhu"
    ],
    "abstract": "I describe an optimal control view of adversarial machine learning, where the dynamical system is the machine learner, the input are adversarial actions, and the control costs are defined by the adversary's goals to do harm and be hard to detect. This view encompasses many types of adversarial machine learning, including test-item attacks, training-data poisoning, and adversarial reward shaping. The view encourages adversarial machine learning researcher to utilize advances in control theory and reinforcement learning.",
    "url": "http://arxiv.org/abs/1811.04422v1",
    "bibtex": "@article{an2018,\n  title={An Optimal Control View of Adversarial Machine Learning},\n  author={Xiaojin Zhu},\n  year={2018},\n  url={http://arxiv.org/abs/1811.04422v1},\n  note={arXiv preprint}\n}",
    "year": 2018,
    "relevance_score": 1.0,
    "source": "arxiv",
    "citation_count": null,
    "doi": null
  },
  {
    "title": "Minimax deviation strategies for machine learning and recognition with   short learning samples",
    "authors": [
      "Michail Schlesinger",
      "Evgeniy Vodolazskiy"
    ],
    "abstract": "The article is devoted to the problem of small learning samples in machine learning. The flaws of maximum likelihood learning and minimax learning are looked into and the concept of minimax deviation learning is introduced that is free of those flaws.",
    "url": "http://arxiv.org/abs/1707.04849v1",
    "bibtex": "@article{minimax2017,\n  title={Minimax deviation strategies for machine learning and recognition with   short learning samples},\n  author={Michail Schlesinger and Evgeniy Vodolazskiy},\n  year={2017},\n  url={http://arxiv.org/abs/1707.04849v1},\n  note={arXiv preprint}\n}",
    "year": 2017,
    "relevance_score": 1.0,
    "source": "arxiv",
    "citation_count": null,
    "doi": null
  },
  {
    "title": "Machine Learning for Clinical Predictive Analytics",
    "authors": [
      "Wei-Hung Weng"
    ],
    "abstract": "In this chapter, we provide a brief overview of applying machine learning techniques for clinical prediction tasks. We begin with a quick introduction to the concepts of machine learning and outline some of the most common machine learning algorithms. Next, we demonstrate how to apply the algorithms with appropriate toolkits to conduct machine learning experiments for clinical prediction tasks. The objectives of this chapter are to (1) understand the basics of machine learning techniques and the reasons behind why they are useful for solving clinical prediction problems, (2) understand the intuition behind some machine learning models, including regression, decision trees, and support vector machines, and (3) understand how to apply these models to clinical prediction problems using publicly available datasets via case studies.",
    "url": "http://arxiv.org/abs/1909.09246v1",
    "bibtex": "@article{machine2019,\n  title={Machine Learning for Clinical Predictive Analytics},\n  author={Wei-Hung Weng},\n  year={2019},\n  url={http://arxiv.org/abs/1909.09246v1},\n  note={arXiv preprint}\n}",
    "year": 2019,
    "relevance_score": 1.0,
    "source": "arxiv",
    "citation_count": null,
    "doi": null
  },
  {
    "title": "Towards Modular Machine Learning Solution Development: Benefits and   Trade-offs",
    "authors": [
      "Samiyuru Menik",
      "Lakshmish Ramaswamy"
    ],
    "abstract": "Machine learning technologies have demonstrated immense capabilities in various domains. They play a key role in the success of modern businesses. However, adoption of machine learning technologies has a lot of untouched potential. Cost of developing custom machine learning solutions that solve unique business problems is a major inhibitor to far-reaching adoption of machine learning technologies. We recognize that the monolithic nature prevalent in today's machine learning applications stands in the way of efficient and cost effective customized machine learning solution development. In this work we explore the benefits of modular machine learning solutions and discuss how modular machine learning solutions can overcome some of the major solution engineering limitations of monolithic machine learning solutions. We analyze the trade-offs between modular and monolithic machine learning solutions through three deep learning problems; one text based and the two image based. Our experimental results show that modular machine learning solutions have a promising potential to reap the solution engineering advantages of modularity while gaining performance and data advantages in a way the monolithic machine learning solutions do not permit.",
    "url": "http://arxiv.org/abs/2301.09753v1",
    "bibtex": "@article{towards2023,\n  title={Towards Modular Machine Learning Solution Development: Benefits and   Trade-offs},\n  author={Samiyuru Menik and Lakshmish Ramaswamy},\n  year={2023},\n  url={http://arxiv.org/abs/2301.09753v1},\n  note={arXiv preprint}\n}",
    "year": 2023,
    "relevance_score": 1.0,
    "source": "arxiv",
    "citation_count": null,
    "doi": null
  },
  {
    "title": "Machine learning with sklearn",
    "authors": [
      "Thomas P. Trappenberg"
    ],
    "abstract": "<p>This chapter’s goal is to show how to apply machine learning algorithms in a general setting using some classic methods. In particular, it demonstrates how to apply three important machine learning algorithms, a support vector classifier (SVC), a random forest classifier (RFC), and a multilayer perceptron (MLP). While many of the methods studied later go beyond these now classic methods, this does not mean that these methods are obsolete. Also, the algorithms discussed here provide some form ...",
    "url": "https://doi.org/10.1093/oso/9780198828044.003.0003",
    "bibtex": "@article{machine2019,\n  title={Machine learning with sklearn},\n  author={Thomas P. Trappenberg},\n  year={2019},\n  journal={Fundamentals of Machine Learning},\n  doi={10.1093/oso/9780198828044.003.0003}\n}",
    "year": 2019,
    "relevance_score": 1.0,
    "source": "crossref",
    "citation_count": null,
    "doi": "10.1093/oso/9780198828044.003.0003"
  },
  {
    "title": "Optimization and Machine Learning",
    "authors": [],
    "abstract": "Abstract not available",
    "url": "https://doi.org/10.1002/9781119902881",
    "bibtex": "@article{optimization2022,\n  title={Optimization and Machine Learning},\n  author={Unknown},\n  year={2022},\n  doi={10.1002/9781119902881}\n}",
    "year": 2022,
    "relevance_score": 1.0,
    "source": "crossref",
    "citation_count": null,
    "doi": "10.1002/9781119902881"
  },
  {
    "title": "Machine learning",
    "authors": [],
    "abstract": "Abstract not available",
    "url": "https://doi.org/10.1017/cbo9780511804779.017",
    "bibtex": "@article{machine2012,\n  title={Machine learning},\n  author={Unknown},\n  year={2012},\n  journal={Bayesian Reasoning and Machine Learning},\n  doi={10.1017/cbo9780511804779.017}\n}",
    "year": 2012,
    "relevance_score": 1.0,
    "source": "crossref",
    "citation_count": null,
    "doi": "10.1017/cbo9780511804779.017"
  },
  {
    "title": "Why Use Automated Machine Learning?",
    "authors": [
      "Kai R. Larsen",
      "Daniel S. Becker"
    ],
    "abstract": "<p>Machine learning is involved in search, translation, detecting depression, likelihood of college dropout, finding lost children, and to sell all kinds of products. While barely beyond its inception, the current machine learning revolution will affect people and organizations no less than the Industrial Revolution’s effect on weavers and many other skilled laborers. Machine learning will automate hundreds of millions of jobs that were considered too complex for machines ever to take over even ...",
    "url": "https://doi.org/10.1093/oso/9780190941659.003.0001",
    "bibtex": "@article{why2021,\n  title={Why Use Automated Machine Learning?},\n  author={Kai R. Larsen and Daniel S. Becker},\n  year={2021},\n  journal={Automated Machine Learning for Business},\n  doi={10.1093/oso/9780190941659.003.0001}\n}",
    "year": 2021,
    "relevance_score": 0.5,
    "source": "crossref",
    "citation_count": null,
    "doi": "10.1093/oso/9780190941659.003.0001"
  }
]